Revit 2024 API
FolderItemInfo Members
The FolderItemInfo type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FolderItemInfo
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ElementId
 The folder parameter Id
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The folder name
See Also
FolderItemInfo Class
Autodesk.Revit.DB Namespace